tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "minamijoyo/tfupdate"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10", link: true
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Fancy interface to the Python interpreter
brew "bpython"
# New way to see and navigate directory trees
brew "broot"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Library for USB device access
brew "libusb"
# USB programmer
brew "dfu-util"
# Load/unload environment variables based on $PWD
brew "direnv"
# Friendly and expressive shell
brew "elvish"
# Modern replacement for 'ls'
brew "exa"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Password generator
brew "pwgen"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Implementation of the STUN protocol
brew "stuntman"
# Open source continuous file synchronization application
brew "syncthing", link: false
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "terraform"
# CLI tool that moves files or folder to the trash
brew "trash"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Update version constraints in your Terraform configurations
brew "minamijoyo/tfupdate/tfupdate"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Sends audio from computer to outputs
cask "airfoil"
# Application launcher and productivity software
cask "alfred"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Monitors common persistence locations
cask "blockblock"
# Free and open-source web browser
cask "chromium"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# Open-source physical access (aka 'evil maid') attack detector
cask "do-not-disturb"
# Web browser
cask "firefox-beta"
cask "font-meslo-lg-nerd-font"
# Desktop automation application
cask "hammerspoon"
# Companion app for Home Assistant home automation software
cask "home-assistant"
# Free and open-source media player
cask "iina"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Keyboard customizer
cask "karabiner-elements"
# File archiver
cask "keka"
# Display all currently loaded kexts
cask "kextviewr"
# GPU-based terminal emulator
cask "kitty"
# Host-based application firewall
cask "little-snitch"
# Trims video and audio files losslessly
cask "losslesscut"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Media player based on MPlayer and mplayer2
cask "mpv"
# Open-source software for live streaming and screen recording
cask "obs"
# Programmable solid 3D CAD modeller
cask "openscad"
# Monitors computer mic and webcam
cask "oversight"
# Desktop virtualization software
cask "parallels"
# Access and edit GoPro photos and videos
cask "quik"
# Tool to format memory cards complying with the SD File System spec
cask "sdformatter"
# Instant messaging application focusing on security
cask "signal"
# Code-based music creation and performance tool
cask "sonic-pi"
# Video game digital distribution service
cask "steam"
# Controls screen display settings
cask "switchresx"
# Real time file synchronization software
cask "syncthing"
# Tool to explore all the running tasks (processes)
cask "taskexplorer"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# Web browser focusing on security
cask "tor-browser"
# 3D printer and slicing GUI
cask "ultimaker-cura"
# PKG software package uninstall tool
cask "uninstallpkg"
# Web browser focusing on customization and control
cask "vivaldi"
# Lossless audio decoder
cask "xld"
# Professional SSH client and terminal emulator
cask "zoc"
# Azul ZuluFX Java Standard Edition Development Kit
cask "zulufx"
