tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Portable Foreign Function Interface library
brew "libffi"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Automatic configure script builder
brew "autoconf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Library for USB device access
brew "libusb"
# Swiss army knife for network attacks and monitoring
brew "bettercap"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# Static analysis of C and C++ code
brew "cppcheck"
# USB programmer
brew "dfu-util"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern replacement for 'ls'
brew "exa"
# Read-only implementation of ext4 for FUSE
brew "ext4fuse"
# CLI tool for quick access to files and directories
brew "fasd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# GNU multiple precision arithmetic library
brew "gmp"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Lightweight and flexible command-line JSON processor
brew "jq"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Sophisticated file transfer program
brew "lftp"
# Library to talk to FTDI chips
brew "libftdi"
# Library for USB device access
brew "libusb-compat"
# Create icns files from the command-line
brew "makeicns"
# Command-line based markdown presentation tool
brew "mdp"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@10"
# Provides an easy way to use U2F-compliant authenticators with PAM
brew "pam-u2f"
# Manage compile and link flags for libraries
brew "pkg-config"
# Beautiful and useful low-latency prompt for your shell
brew "powerline-go"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Secure Programming Lint
brew "splint"
# Open source flash program for STM32 using the ST serial bootloader
brew "stm32flash"
# Open source continuous file synchronization application
brew "syncthing"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher"
# Programatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Command-line client for Travis CI
brew "travis"
# Extract, view, and test RAR archives
brew "unrar"
# Run Windows applications without a copy of Microsoft Windows
brew "wine"
# Download YouTube videos from the command-line
brew "youtube-dl"
cask "0xed"
cask "1password-beta"
cask "airfoil"
cask "alacritty"
cask "alfred"
cask "android-platform-tools"
cask "arduino"
cask "balenaetcher"
cask "betaflight-configurator"
cask "blockblock"
cask "burn"
cask "carbon-copy-cloner"
cask "chromium"
cask "clamxav"
cask "cyberduck"
cask "discord"
cask "duet"
cask "font-fira-mono-for-powerline"
cask "font-firacode-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklig-nerd-font"
cask "font-liberation-mono-for-powerline"
cask "font-roboto-mono-for-powerline"
cask "ftdi-vcp-driver"
cask "gzdoom"
cask "hammerspoon"
cask "imageoptim"
cask "istat-menus"
cask "kap-beta"
cask "karabiner-elements"
cask "keka"
cask "kicad"
cask "kitty"
cask "little-snitch-nightly"
cask "midi-monitor"
cask "mpv"
cask "obs"
cask "openemu"
cask "openscad"
cask "opera-developer"
cask "oversight"
cask "reikey"
cask "sdformatter"
cask "shotcut"
cask "silicon-labs-vcp-driver"
cask "steam"
cask "sublime-text-dev"
cask "telegram"
cask "transmission"
cask "uninstallpkg"
cask "vdmx"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "wch-ch34x-usb-serial-driver"
cask "wireshark"
cask "xld"
cask "zoc"
