tap 'caskroom/cask'
tap 'homebrew/bundle'

# tap 'homebrew/games'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'domt4/chromium'
tap 'homebrew/command-not-found'
tap 'homebrew/completions'
tap 'homebrew/dupes'
tap 'homebrew/fuse'
tap 'homebrew/gui'
tap 'homebrew/head-only'
tap 'homebrew/science'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'peco/peco'
tap 'telemachus/desc'

brew 'bash'
brew 'brew-cask-completion'
brew 'curl'
brew 'direnv'
brew 'fasd'
brew 'fish'
brew 'git'
brew 'go'
brew 'gpg'
brew 'hub'
brew 'keybase'
brew 'keychain'
brew 'ldns'
brew 'libffi'
brew 'libpng'
brew 'libyaml'
brew 'mas'
brew 'nmap'
brew 'node'
brew 'openssl'
brew 'peco'
brew 'pyenv'
brew 'readline'
brew 'ruby-install'
brew 'syncthing'
brew 'tarsnap'
brew 'terminal-notifier'
brew 'the_platinum_searcher'
brew 'thefuck'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'unzip'
brew 'vcprompt'
brew 'wakeonlan'
brew 'xz'

# cask 'cyberduck'
# cask 'mattr-slate'
cask 'alfred'
cask 'atom-beta'
cask 'blockblock'
cask 'bonjour-browser'
cask 'chromium'
cask 'firefoxnightly'
cask 'flux'
cask 'font-liberation-mono-for-powerline'
cask 'imagealpha'
cask 'imageoptim'
cask 'insomniax'
cask 'iterm2-nightly'
cask 'karabiner'
cask 'keka'
cask 'noejectdelay'
cask 'qsyncthingtray'
cask 'seil'
cask 'sublime-text-dev'
# cask 'syncthing'
cask 'telegram'
cask 'timemachinescheduler'
cask 'vlc-nightly'
cask 'xld'
