brew 'autoconf'
brew 'bash'
brew 'bash-completion'
brew 'cmake'
brew 'curl'
brew 'direnv'
brew 'fasd'
brew 'fish', args: ['HEAD']
brew 'fzf'
brew 'gist'
brew 'git'
brew 'git-secrets'
brew 'go'
brew 'godep'
brew 'grc'
brew 'brew-cask-completion'
brew 'joe'
brew 'keybase'
brew 'keychain'
brew 'ldns'
brew 'libffi'
brew 'libsodium'
brew 'libyaml'
brew 'mas'
brew 'mercurial'
brew 'nmap'
brew 'node'
brew 'openssl'
brew 'pandoc'
brew 'pkg-config'
brew 'pyenv'
brew 'readline'
brew 'ruby-install'
brew 'shellcheck'
brew 'sqlite'
brew 'syncthing'
brew 'syncthing-inotify'
brew 'tarsnap', args: ['with-xz']
brew 'terminal-notifier'
brew 'the_platinum_searcher'
brew 'thefuck'
brew 'trash'
brew 'ttyrec'
brew 'unrar'
brew 'vcprompt', args: ['HEAD']
brew 'xz'
cask '0xed'
cask '1password-beta'
cask 'alfred'
cask 'atom-beta'
cask 'avira-antivirus'
cask 'blockblock'
cask 'cyberduck'
cask 'ftdi-vcp-driver'
cask 'firefoxnightly'
cask 'flux'
cask 'font-liberation-mono-for-powerline'
cask 'imageoptim'
cask 'insomniax'
cask 'iterm2-nightly'
cask 'keka'
cask 'prey'
cask 'slack'
cask 'sublime-text'
cask 'telegram'
cask 'timemachinescheduler'
cask 'trash-it'
cask 'virtualbox', restart_service: :changed
cask 'vlc-nightly'
cask 'xld'
cask_args appdir: '/Applications'
mas 'Keynote', id: 409183694
mas 'Loadables', id: 436748346
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Remote Desktop', id: 409907375
mas 'TrashMe', id: 443126292
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/fuse'
tap 'homebrew/head-only'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/services'
tap 'homebrew/versions'
