tap "homebrew/bundle"
tap "homebrew/services"
tap "jorgelbg/tap"
tap "rsteube/tap"
brew "python@3.13"
brew "asciinema"
brew "bat"
brew "direnv"
brew "elvish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "pinentry"
brew "gnupg"
brew "graphviz"
brew "hadolint"
brew "jq"
brew "keychain"
brew "lsd"
brew "mas"
brew "nmap"
brew "podman"
brew "pwgen"
brew "ripgrep"
brew "rust"
brew "shellcheck"
brew "starship"
brew "tailspin"
brew "terminal-notifier"
brew "tmux"
brew "trash", link: true
brew "trivy"
brew "zellij"
brew "zoxide"
brew "jorgelbg/tap/pinentry-touchid"
brew "rsteube/tap/carapace"
cask "1password-cli"
cask "1password@beta"
cask "alfred"
cask "bitwarden"
cask "blockblock"
cask "firefox@beta"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "forkgram-telegram"
cask "hammerspoon"
cask "hyperkey"
cask "iina"
cask "imageoptim"
cask "keepingyouawake"
cask "keka"
cask "knockknock"
cask "lm-studio"
cask "lulu"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "murus"
cask "reikey"
cask "signal"
cask "ssdreporter-free"
cask "sublime-text"
cask "syncthing"
cask "uninstallpkg"
cask "utm@beta"
cask "wezterm@nightly"
mas "Apple Configurator", id: 1037126344
mas "WireGuard", id: 1451685025
