tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'domt4/chromium'
tap 'homebrew/binary'
tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/fuse'
tap 'homebrew/gui'
tap 'homebrew/head-only'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'peco/peco'
tap 'rcmdnk/file'
tap 'telemachus/desc'
brew 'autoconf'
brew 'readline'
brew 'bash'
brew 'bash-completion'
brew 'xz'
brew 'ghc'
brew 'cabal-install'
brew 'ccache'
brew 'cmake'
brew 'openssl'
brew 'pkg-config'
brew 'libressl'
brew 'curl', args: ['with-libressl']
brew 'gettext'
brew 'git'
brew 'go'
brew 'direnv', args: ['HEAD']
brew 'doxygen'
brew 'fasd'
brew 'pcre2'
brew 'fish', args: ['HEAD']
brew 'fzf', args: ['HEAD']
brew 'gmp'
brew 'mpfr'
brew 'libmpc'
brew 'isl'
brew 'gcc', args: ['without-fortran', 'without-multilib']
brew 'gdbm'
brew 'gist'
brew 'git-secrets'
brew 'libgpg-error'
brew 'libgcrypt'
brew 'libksba'
brew 'libassuan'
brew 'pinentry'
brew 'pth'
brew 'gpg-agent'
brew 'gnupg2'
brew 'grc', args: ['HEAD']
brew 'hub'
brew 'joe'
brew 'keybase'
brew 'keychain'
brew 'ldns'
brew 'libffi'
brew 'libpng'
brew 'libsodium'
brew 'libxml2'
brew 'libyaml'
brew 'mas'
brew 'mercurial'
brew 'nmap'
brew 'node'
brew 'pandoc'
brew 'pyenv', args: ['HEAD']
brew 'ruby-build'
brew 'ruby-install', args: ['HEAD']
brew 'ry', args: ['HEAD']
brew 'shellcheck', args: ['HEAD']
brew 'sqlite'
brew 'syncthing'
brew 'syncthing-inotify', args: ['HEAD']
brew 'tarsnap', args: ['with-xz']
brew 'terminal-notifier'
brew 'the_platinum_searcher'
brew 'thefuck'
brew 'trash'
brew 'unrar'
brew 'vcprompt', args: ['HEAD']
brew 'homebrew/completions/brew-cask-completion'
brew 'homebrew/dupes/unzip'
brew 'rcmdnk/file/brew-file'
cask '0xed'
cask '1password-beta'
cask 'alfred'
cask 'atom-beta'
cask 'avira-antivirus'
cask 'blockblock'
cask 'cyberduck'
cask 'etrecheck'
cask 'exa'
cask 'firefoxnightly'
cask 'flux'
cask 'font-liberation-mono-for-powerline'
cask 'font-mononoki'
cask 'imagealpha'
cask 'imageoptim'
cask 'insomniax'
cask 'iterm2-nightly'
cask 'keka'
cask 'noejectdelay'
cask 'prey'
cask 'slack'
cask 'sublime-text3'
cask 'telegram'
cask 'timemachinescheduler'
cask 'trash-it'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'vlc-nightly'
cask 'xld'
mas 'Loadables', id: 436748346
mas 'Remote Desktop', id: 409907375
mas 'TrashMe', id: 443126292
mas 'Steuererklärung', id: 748816884
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Install OS X El Capitan', id: 1018109117
mas 'Numbers', id: 409203825
