fisherman/anicode
fisherman/choices
fisherman/cyber
oh-my-fish/plugin-fasd
fisherman/fishkit
fisherman/get
fisherman/getopts
fisherman/git_util
fisherman/host_info
fisherman/humanize_duration
fisherman/last_job_id
fisherman/menu
fisherman/metro
fisherman/pwd_info
fisherman/pwd_is_home
fisherman/segment
fisherman/sol
fisherman/spin
